import { Link } from "react-router-dom";

export function Footer() {
    return (
        <footer className="footer footer-main">
            <div className="footer__container container">
                <div className="footer__inner">
                    <div className="footer__top">
                        <Link to="/" className="footer__logo">
                            <svg xmlns="http://www.w3.org/2000/svg" width={146} height={40} viewBox="0 0 146 40" fill="none">
                                <g clipPath="url(#clip0_12_527)">
                                    <path d="M27.0296 28.9242L17.1285 38.7674C16.3348 39.5565 15.2582 39.9999 14.1357 39.9999C13.0132 39.9999 11.9366 39.5565 11.1428 38.7674L1.24185 28.9242C0.848203 28.5337 0.535885 28.07 0.322787 27.5595C0.109689 27.0489 0 26.5015 0 25.9487C0 25.396 0.109689 24.8486 0.322787 24.3381C0.535885 23.8275 0.848203 23.3637 1.24185 22.9734L2.31068 21.9107L4.34168 19.8916L11.3597 26.8687C12.1535 27.6577 13.2301 28.1011 14.3525 28.1011C15.4751 28.1011 16.5517 27.6577 17.3454 26.8687L24.1467 20.1072L27.0296 22.9757C27.423 23.3662 27.7353 23.83 27.9483 24.3405C28.1613 24.8511 28.271 25.3984 28.271 25.9511C28.271 26.5039 28.1613 27.0512 27.9483 27.5617C27.7353 28.0724 27.423 28.5361 27.0296 28.9266V28.9242Z" fill="#873BFF" />
                                    <path d="M27.8068 24.0332C27.6165 24.3728 27.3792 24.6844 27.1022 24.9588L17.2018 34.8021C16.408 35.5912 15.3315 36.0344 14.2089 36.0344C13.0865 36.0344 12.0099 35.5912 11.2161 34.8021L1.3151 24.9588C0.921446 24.5684 0.609126 24.1047 0.396028 23.5941C0.182931 23.0836 0.0732422 22.5362 0.0732422 21.9834C0.0732422 21.4306 0.182931 20.8832 0.396028 20.3727C0.609126 19.8621 0.921446 19.3983 1.3151 19.0079L2.38392 17.9453L4.34243 19.8924L11.3605 26.8696C12.1543 27.6587 13.2308 28.1019 14.3533 28.1019C15.4759 28.1019 16.5524 27.6587 17.3462 26.8696L24.1474 20.1081L26.1784 18.0924L27.1022 19.0109C27.7542 19.6579 28.1759 20.4989 28.303 21.4059C28.4302 22.3131 28.256 23.2366 27.8068 24.0362V24.0332Z" fill="#AF7CFF" />
                                    <path d="M27.8795 20.0677C27.6887 20.4069 27.4516 20.7182 27.175 20.9927L26.106 22.0547L17.2739 30.8383C16.4802 31.6274 15.4036 32.0707 14.281 32.0707C13.1585 32.0707 12.082 31.6274 11.2882 30.8383L1.38779 20.9927C0.735652 20.3457 0.313968 19.5045 0.186895 18.5973C0.0598218 17.69 0.234317 16.7664 0.683831 15.9668C0.885837 16.3585 1.14868 16.7162 1.46268 17.0264L2.38651 17.9449L4.34502 19.892L11.3631 26.869C12.1568 27.6582 13.2335 28.1014 14.3559 28.1014C15.4785 28.1014 16.555 27.6582 17.3488 26.869L24.1475 20.1075L26.1785 18.092L27.2473 17.0294C27.524 16.7552 27.7608 16.444 27.9514 16.105C28.2671 16.7208 28.4256 17.4043 28.4131 18.0953C28.4006 18.7863 28.2173 19.4637 27.8795 20.0677Z" fill="#D7BEFF" />
                                    <path d="M27.9488 16.1021C27.7582 16.4411 27.5213 16.7522 27.2447 17.0265L26.1759 18.092L24.1449 20.1106L17.3438 26.8691C16.55 27.6583 15.4735 28.1015 14.3509 28.1015C13.2284 28.1015 12.1518 27.6583 11.358 26.8691L4.34 19.892L2.38149 17.9449L1.45766 17.0265C1.06429 16.6359 0.752225 16.1721 0.539308 15.6615C0.32639 15.151 0.216797 14.6038 0.216797 14.051C0.216797 13.4984 0.32639 12.9511 0.539308 12.4405C0.752225 11.93 1.06429 11.4662 1.45766 11.0756L11.358 1.23239C12.1518 0.443299 13.2284 0 14.3509 0C15.4735 0 16.55 0.443299 17.3438 1.23239L27.2447 11.0756C27.8962 11.7232 28.3174 12.5644 28.4444 13.4715C28.5715 14.3786 28.3974 15.3021 27.9488 16.1021Z" fill="white" />
                                    <path d="M55.4319 28.0138L55.4086 18.3969L50.6642 26.3186H48.9831L44.2614 18.6018V28.0125H40.7578V11.9844H43.8439L49.8782 21.9449L55.8201 11.9844H58.8834L58.9296 28.0125L55.4319 28.0138Z" fill="black" />
                                    <path d="M61.3037 26.8684L62.5019 24.3073C63.6073 25.0166 65.2884 25.4984 66.8083 25.4984C68.4667 25.4984 69.0885 25.063 69.0885 24.3763C69.0885 22.3613 61.6032 24.4221 61.6032 19.4994C61.6032 17.1634 63.7223 15.5146 67.3385 15.5146C69.0425 15.5146 70.9332 15.9041 72.1057 16.5909L70.9075 19.1325C69.8191 18.5209 68.588 18.2051 67.3379 18.217C65.7258 18.217 65.0343 18.7203 65.0343 19.3618C65.0343 21.4685 72.5196 19.4303 72.5196 24.2845C72.5196 26.5748 70.3778 28.2001 66.6699 28.2001C64.573 28.1966 62.4546 27.6243 61.3037 26.8684Z" fill="black" />
                                    <path d="M80.0504 23.1829L78.3231 24.8774V28.0139H74.7285V11.0244H78.3231V20.6414L83.5744 15.6976H87.8587L82.6991 20.9182L88.3194 28.0162H83.9662L80.0504 23.1829Z" fill="black" />
                                    <path d="M107.122 11.9863V28.0145H103.391V21.443H96.0663V28.0145H92.335V11.9863H96.0663V18.3059H103.391V11.9863H107.122Z" fill="black" />
                                    <path d="M109.773 21.8545C109.773 18.145 112.652 15.5117 116.591 15.5117C120.529 15.5117 123.385 18.145 123.385 21.8545C123.385 25.564 120.529 28.1972 116.591 28.1972C112.652 28.1972 109.773 25.564 109.773 21.8545ZM119.746 21.8545C119.746 19.7251 118.387 18.4427 116.591 18.4427C114.795 18.4427 113.412 19.7251 113.412 21.8545C113.412 23.9838 114.794 25.2662 116.591 25.2662C118.387 25.2662 119.744 23.9838 119.744 21.8545H119.746Z" fill="black" />
                                    <path d="M124.579 26.8684L125.777 24.3073C126.883 25.0166 128.565 25.4984 130.085 25.4984C131.743 25.4984 132.365 25.063 132.365 24.3763C132.365 22.3613 124.88 24.4221 124.88 19.4994C124.88 17.1634 126.999 15.5146 130.614 15.5146C132.318 15.5146 134.209 15.9041 135.382 16.5909L134.184 19.1325C133.095 18.5208 131.864 18.205 130.614 18.217C129.002 18.217 128.31 18.7203 128.31 19.3618C128.31 21.4685 135.796 19.4303 135.796 24.2845C135.796 26.5748 133.654 28.2001 129.946 28.2001C127.85 28.1966 125.731 27.6243 124.579 26.8684Z" fill="black" />
                                    <path d="M146 27.4179C145.263 27.9445 144.181 28.1964 143.074 28.1964C140.15 28.1964 138.446 26.7074 138.446 23.7769V18.7141H136.534V15.9665H138.446V12.9688H142.04V15.9683H145.126V18.7159H142.04V23.731C142.04 24.7841 142.616 25.3565 143.583 25.3565C144.112 25.3565 144.643 25.1962 145.033 24.8985L146 27.4179Z" fill="black" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_12_527">
                                        <rect width={146} height={40} fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </Link>
                        <div className="footer__top-main">
                            <p className="footer__top-text">
                                Однажды… и навсегда… с MskHost
                                <img src="img/footer/img.png" alt="img" className="footer__top-img" />
                            </p>
                            <div className="footer__top-btns">
                                <a href="https://my.msk.host" className="footer__top-link btn-main">Личный кабинет</a>
                                <Link to="/web-hosting" className="footer__top-link btn-grey">Хостинг решения</Link>
                            </div>
                        </div>
                    </div>
                    <div className="footer__main">
                        <div className="footer__column">
                            <p className="footer__column-name">Юридическая информация</p>
                            <p className="footer__column-desc">
                                ООО&nbsp;«Облачные решения» <br /> ИНН: 6312219617 <br /> ОГРН: 1246300020064 <br /> 443035,
                                Самарская область, г&nbsp;Самара, <br /> Мирная ул, зд. 3 к. 1, каб. № 13
                            </p>
                        </div>
                        <div className="footer__columns">
                            <div className="footer__column">
                                <p className="footer__column-name">Навигация</p>
                                <ul className="footer__column-list">
                                    <li className="footer__column-item">
                                        <Link to="/" className="footer__column-item-link">Главная</Link>
                                    </li>
                                    <li className="footer__column-item">
                                        <Link to="/vds" className="footer__column-item-link">Мощные VPS</Link>
                                    </li>
                                    <li className="footer__column-item">
                                        <Link to="/web-hosting" className="footer__column-item-link">Веб-хостинг</Link>
                                    </li>
                                    <li className="footer__column-item">
                                        <a href="https://my.msk.host" className="footer__column-item-link">Личный кабинет</a>
                                    </li>
                                    <li className="footer__column-item">
                                        <a href="https://t.me/mskhost_sup" className="footer__column-item-link">Поддержка</a>
                                    </li>
                                </ul>
                            </div>
                            <div className="footer__column">
                                <p className="footer__column-name">О MskHost</p>
                                <ul className="footer__column-list">
                                    <li className="footer__column-item">
                                        <a href="https://t.me/mskhost" className="footer__column-item-link">Телеграм канал</a>
                                    </li>
                                    {/* <li className="footer__column-item">
                                        <a href="#" className="footer__column-item-link">Мы на VC.RU</a>
                                    </li> */}
                                    <li className="footer__column-item">
                                        <a href="https://www.youtube.com/@mskhostit1599" className="footer__column-item-link">Youtube канал</a>
                                    </li>
                                    <li className="footer__column-item">
                                        <a href="https://vk.com/mskhost" className="footer__column-item-link">Группа ВК</a>
                                    </li>
                                    {/* <li className="footer__column-item">
                                        <a href="#" className="footer__column-item-link">Мы на Хабр</a>
                                    </li> */}
                                </ul>
                            </div>
                            {/* <div className="footer__column">
                                <p className="footer__column-name">Документы</p>
                                <ul className="footer__column-list">
                                    <li className="footer__column-item">
                                        <a href="#" className="footer__column-item-link">Политика конфиденциальности</a>
                                    </li>
                                    <li className="footer__column-item">
                                        <a href="#" className="footer__column-item-link">Пользовательское соглашение</a>
                                    </li>
                                    <li className="footer__column-item">
                                        <a href="#" className="footer__column-item-link">Агентский договор</a>
                                    </li>
                                </ul>
                            </div> */}
                        </div>
                    </div>
                    <div className="footer__bottom">
                        <p className="footer__bottom-text">Copyright © 2025 MskHost. All rights reserved.</p>
                    </div>
                </div>
            </div>
        </footer>

    )
}